
// Ex No1
// (Порівняння чисел: За допомогою prompt отримайте два числа від користувача. Використовуючи if, else if, і else, виведіть у консоль, яке з них більше, менше, або вони рівні. Пам'ятайте про різницю між == і ===.)


// let userage = Number(prompt('Cкільки Вам років?'));
// console.log(userage);
// let fatherage = Number(prompt('скільки років вашому тату?'));
// console.log(fatherage);
// if (userage > fatherage)
// {
// let age = userage-fatherage;
// alert ('Ви старше батька на ' + age);
// }
// else if (userage < fatherage)
// {
// let agetwo = fatherage-userage;
// alert ('Батько страше на ' + agetwo);
// }
// else if (userage === fatherage){
// let agethree = fatherage===userage;
// alert ('Ви одного віку');
// }

// -----------------------------------------------------------------------


// Ex No2
// (Перевірка парності: Запитайте у користувача число за допомогою prompt. Використовуючи оператор % та if-else, визначте, чи є число парним або непарним, і виведіть відповідне повідомлення у консоль.)

// let usernumber = Number(prompt('Введіть будь-яке ціле число'));
// if (usernumber %2===0){
//     console.log('число є парне');
// }
// else if (usernumber %2 !=0 ){
//     console.log('число не є парне');
// }

// -----------------------------------------------------------------------



// Ex No3
// (Визначення року народження: Запитайте в користувача його вік за допомогою prompt. Використовуючи отримане значення та поточний рік (ви можете захардкодити поточний рік), виведіть у консоль рік народження користувача.)

// let useryear = Number(prompt('Якого Ви року народження?'));
// let userage = (2024-useryear);
// alert('Вам '+userage+ ' років' );

// -----------------------------------------------------------------------




// Ex No4
// (Вгадай число: Запитайте у користувача число. Якщо введене число більше заданого вами (наприклад, 10), виведіть "Занадто велике". Якщо менше - "Занадто мале". Якщо користувач вгадав число, виведіть "Вітаємо, ви вгадали!".)

// while (true){
// let usernumber =Number(prompt('Вгадайте число від 1 до 30'));
// if (usernumber > 16){
//     alert('Занадто велике');
// }
// else if (usernumber <16){
//     alert('Занадто мале');
// }
// else if (usernumber===16) break;
// }
// alert('Вітаю, Ви відгадали число!');

// -----------------------------------------------------------------------




// Ex No5
// (Класифікація за оцінками: Запитайте у користувача його оцінку за 10-бальною шкалою за допомогою prompt. За допомогою if-else виведіть в консоль "Відмінно" (8-10), "Добре" (5-7), "Задовільно" (3-4), "Незадовільно" (менше 3).)

// let usergrade =Number(prompt('Яка ваша річна оцінка з матиматики?'));
// if (usergrade <= 10 && usergrade >= 8 ){
//     alert('Відмінно!');
// }
// else if (usergrade <=7 && usergrade >=5 ){
//     alert('Добре');
// }
// else if (usergrade <=7 && usergrade >=5 ){
//     alert('Добре');
// }
// else if (usergrade <=4 && usergrade >=3 ){
//     alert('Задовільно');
// }
// else if (usergrade <=2 ){
//     alert('Незадовільно');
// }

// -----------------------------------------------------------------------




// Ex No6
// (Перевірка діапазону: Запитайте у користувача число. Якщо число знаходиться в діапазоні від 1 до 100 включно, виведіть "Число знаходиться в діапазоні". Якщо ні - "Число поза діапазоном".)

// let usernumber = Number(prompt('Введіть будь-яке ціле число'));
// if (usernumber <=100 ){
//     alert('Число знаходиться в діапазоні');
// }
// else if (usernumber >= 100){
//     alert('Число поза діапазоном');
// }

// -----------------------------------------------------------------------




// Ex No7
//  (Перепишіть використовуючи тернарний оператор
//     let result = '';
//     let score = 75;
//     if (score > 50) {
//         result ="Пройшов";
//     } else {
//         result ="Не пройшов";
//     }
//     let tempResult = "";
//     let temperature = 30;
//     if (temperature > 25) {
//         tempResult ="Гаряче";
//     } else {
//         tempResult ="Прохолодно";
//     })

//1.

// let score = 75 ;
// let result = score>50 ? console.log('Пройшов') : console.log('Не пройшов');

//2.
// let temperature= Number(prompt('Яка температура за вікном?'));
// let tempresult = temperature>25 ? alert('Жарко') : alert('Прохолодно');

// -----------------------------------------------------------------------



// Додаткова робота
// (Створіть програму для перевірки віку та країни проживання користувача з використанням prompt. Користувач має ввести свій вік та країну. Якщо вік більше 18 років і користувач з України, виведіть "Вітаємо, ви маєте право голосу в Україні". В іншому випадку, якщо вік більше 18, але країна не Україна, виведіть "Перевірте правила голосування у вашій країні". Якщо вік менше 18, виведіть "Ви ще занадто молоді для голосування".)

// let userage=Number(prompt('Скільки вам років?'));
// let usercountry = prompt('З якої ви країни?');
// if(userage>=18 && usercountry==='Україна'){
//     alert('Вітаємо, ви маєте право голосу в Україні');
// }
// else if (userage>=18 && usercountry!=='Україна'){
//     alert("Перевірте правила голосування у вашій країні");
// }
// else if(userage<18){
//     alert('Ви ще занадто молоді для голосування');
// }
// else{
//     alert('Не правельно введені данні');
// }